[
  {
    "_id": 1,
    "category": "Getting Started",
    "title": "From 'Hello World' to Getting Hired as Software Engineer: Strive School meets Mimo",
    "cover": "https://striveschool.ghost.io/content/images/2020/12/M1M06-3.png",
    "readTime": {
      "value": 1,
      "unit": "minute"
    },
    "author": {
      "name": "Tobia De Angelis",
      "avatar": "https://striveschool.ghost.io/content/images/2020/12/tobia_mymoji.jpg"
    },
    "content": "<div class='py-5 blog-content'><p>We're thrilled to announce we're teaming up with <a href='https://getmimo.com/'>Mimo</a> to launch our next Web Engineering program starting on February 1, 2021.</p><p>Mimo is the most popular code-learning app, helping millions of learners make their first steps with programming.</p><p>Since the first time we talked, we realised we have been in fact working in the very same direction: democratising access to become a software engineer.</p><p>We're now teaming up to help those in their community that have realised they truly love programming and aspire to become professionals - able to work as software engineers and transform a hobby and passion in their profession.</p><p>Democratising access to opportunity - either by making it simple to move the first steps and explore the world of programming as Mimo does, or by helping people go pro as we do at Strive School - is what makes both teams excited.</p><ul><li>Download Mimo for <a href='https://itunes.apple.com/us/app/mimo-learn-how-to-code-through/id1133960732?mt=8&amp;at=1000lpyT'>iOS</a> or <a href='https://play.google.com/store/apps/details?id=com.getmimo'>Android</a> here.</li><li><a href='https://strive.school/'>Apply here</a> to our next Web Engineering cohort.</li></ul></div>",
    "createdAt": "04 Dec 2020"
  },
  {
    "_id": 2,
    "category": "The W Pledge",
    "title": "Announcing The W Pledge",
    "cover": "https://striveschool.ghost.io/content/images/2021/03/W-fund-1.png",
    "readTime": {
      "value": 2,
      "unit": "minute"
    },
    "author": {
      "name": "Tobia De Angelis",
      "avatar": "https://striveschool.ghost.io/content/images/2020/12/tobia_mymoji.jpg"
    },
    "content": "<div class='py-5 blog-content'><p>As many of you do, on March 8 I wake up and grab my phone.</p><p>First, I call my grandmother. Then I call my mom. Then I call my aunties and a number of women that I love to bits that have had an outsized impact on my life.</p><p>I called them today but unlike every other day, I had special news to share. &nbsp;I told them that we too are doing our (small) part to make sure the next generation of women have a better opportunity in this world.</p><p>I'm excited to be announcing <strong>The W Pledge</strong>, a new initiative to help close the gender gap.</p><p>We're the first contributors in pledging <strong>€1M in scholarships</strong> - to start.</p><p>We want to see more women in our classes and in tech companies in general and we're ready to do <em>whatever it takes</em> to reach that goal.</p><p>We took the first leap but are looking to add more partner companies that also care about closing the gap and are willing to put their money where their mouths are.</p><p>Why are we doing this, you may ask. Is this some 'marketing stunt'? Is this self-serving? Or is this us doing 'good'?</p><p>It's all of the above. It's just the right thing for a business like us to do in 2021.</p><p>If you know me, you know that I don't belong to the 'woke' culture. &nbsp;I do not like the endless competition of 'wokeness'. Or weaponising social issues to grow our own status by showing 'purity'. The world is messy. I am messy.</p><p>On woke culture, my favorite quote is from former <strong>POTUS, Barack Obama</strong>:</p><blockquote>'That is not activism, that is not bringing about change. If all you're doing is casting stones, you are probably not going to get that far'.</blockquote><p>That is why we also refuse the idea that we are a 'social impact business'. That's not really a thing anymore.</p><p>In our vision, either you run a business, or you run an anti-social business.</p><p>Anti-social businesses create huge negative externalities for society and we believe that, ultimately, they will pay a hefty price for that.</p><p>We don't want to do that: it's in our best interest to strive to build a business that <em>does good and does well.</em></p><p>If you're interested, you can <a href='https://striveschool.typeform.com/to/V0VY5N6F'>pre-apply for the <em>W Pledge</em> scholarship here</a>. We'll reach out back as soon as possible.</p><p>Now, back to work.</p><p>T</p><p>P.S.: if you're interested in helping us train more women and close the gender gap faster, drop me an email at tobia at strive dot school. We are looking for like-minded companies that want to <em>act</em>.</p></div>",
    "createdAt": "08 Mar 2021"
  },
  {
    "_id": 3,
    "category": "Learnings and Tips",
    "title": "So you want to learn coding and become a software engineer? Here are some tips from those who've done it",
    "cover": "https://striveschool.ghost.io/content/images/2020/11/tips02.png",
    "readTime": {
      "value": 3,
      "unit": "minute"
    },
    "author": {
      "name": "Bri Cho",
      "avatar": "https://striveschool.ghost.io/content/images/2020/11/FBBRRZy5_400x400.jpg"
    },
    "content": "<div class='py-5 blog-content'><p>At <a href='https://strive.school/?utm_source=strive_blog&amp;utm_campaign=so-you-want-to-learn-coding-and-become-a-software-engineer'>Strive School</a>, our mission is to build a community of passionate, ambitious, and talented students who will go on to become world class engineers. Currently, we run two cohort-based programs in Web Development with a focus on the MERN stack and in AI Engineering. To date, we've empowered three cohorts of students to launch a career in software engineering (with many more to come), and have an ever growing community on our <a href='https://discord.com/invite/6XghReG?utm_source=strive_blog&amp;utm_campaign=so-you-want-to-learn-coding-and-become-a-software-engineer'>Discord server</a>.</p><p>Learning to code, especially when you are just getting started, can be daunting (I'm speaking from experience as a self-taught coder). With so many free resources out there on the web, learning to code should be simple and straightforward, but the truth is, without the right mindset or the right support system/ infrastructure, giving up happens all too often.</p><p>With this in mind, we wanted to open up the conversation to our community, and get tips and (strong) opinions on what it takes to become a software engineer, from those in our community who are doing it, have done it, or have helped many achieve it. And here are some of the gold nuggets:</p><figure class='kg-card kg-image-card'><img src='https://striveschool.ghost.io/content/images/2020/11/Screen-Shot-2020-11-24-at-3.36.04-PM.png' class='kg-image' alt='' srcset='https://striveschool.ghost.io/content/images/size/w600/2020/11/Screen-Shot-2020-11-24-at-3.36.04-PM.png 600w, https://striveschool.ghost.io/content/images/2020/11/Screen-Shot-2020-11-24-at-3.36.04-PM.png 823w' sizes='(min-width: 720px) 720px'></figure><h3 id='have-a-support-system'>Have a support system</h3><p>From Alessia, our resident career coach:</p><p>'It's often overlooked but to me, the one single most important thing about learning to code or training to become a software engineer, is to have a good support system. We learned this through hundreds of interviews with students, majority of whom say it's a struggle to learn a new skills like programming alone and without structure.'</p><h3 id='learn-to-think-and-practice-practice-practice'>Learn to think and practice, practice, practice</h3><p>For Richard, one of our students in the F20 cohort, it's important to learn to think, rather than learn to code. And we couldn't agree more!</p><p>A handful of students and alums of our program also emphasized the importance of practice and the perseverance to solve problems.</p><h3 id='emphasize-logic-over-syntax'>Emphasize logic over syntax</h3><p>The heavyweight answer and our favorite, is from Lidia, also a part of the F20 Web Dev cohort:</p><p>'I feel like learning a programming language can be compared with the learning of any other 'human' language. Only, if you misspell one word, if you forget on point or a semicolon, the machine cannot just guess from 'context' like we do when we get a tense or a pronunciation wrong. The message doesn't go through at all.'</p><p>'If you want to learn languages to <em>speak</em> them, and don't care about the process of creation and evolution of them, you have to take them for what they are: arbitrary chains of sign with meaning to them. You don't ask yourself with the sign 2 means <em>two</em>, you just know it's that way. <strong>Accepting that syntax CAN BE arbitrary</strong> and that a ternary operator has to be written like that even if it might not make sense to you it's important for getting started, or you will get stuck asking yourself 'why does || mean 'or', it doesn't make sense!' or the meaning behind the spread operator. Of course, much of the syntax has a correspondence with English, so you can get some things out of there. You can and in my opinion SHOULD understand the reason behind a certain way the language works when you already have a firm grasp of what you are doing. At first it should just be sign-to-sign translation from your language to one the computer can understand. That's why I always privilege logic over syntax.'</p><p>Way to go, Lidia! We couldn't have said it better. 🔥</p><p>Indeed, learning to code and transitioning into a career in software engineering need not be hard, but it is important to know that a good support system, the right mentorship, and most importantly, the right mindset, can help you strengthen your learning experience and make it a joyful, elevating, and fulfilling one. </p><p>Understanding it is not the programming language you learn, but the problems you solve with them, and understanding the why and how behind it all, coupled with the undying perseverance to overcome blockers, are what in our experience the most important things to appreciate and manifest when it comes to learning to code.</p><p>Got more tips? Let us know 👉 on <a href='https://discord.com/invite/6XghReG?utm_source=strive_blog&amp;utm_campaign=so-you-want-to-learn-coding-and-become-a-software-engineer'>Discord</a>!</p></div>",
    "createdAt": "25 Nov 2020"
  },
  {
    "_id": 4,
    "category": "Student Stories",
    "title": "I was a salesman 6 months ago, and now I am a professional web developer",
    "cover": "https://striveschool.ghost.io/content/images/2020/11/Ervins.png",
    "readTime": {
      "value": 2,
      "unit": "minute"
    },
    "author": {
      "name": "Bri Cho",
      "avatar": "https://striveschool.ghost.io/content/images/2020/11/FBBRRZy5_400x400.jpg"
    },
    "content": "<div class='py-5 blog-content'><p>Ervins, one of the fresh graduates from Strive School's latest Web Development program, joined the Latvia-based digital agency <a href='https://revpanda.com/'>RevPanda</a> three weeks earlier. Were you to ask him at the beginning of the Covid-19 pandemic what he'd be doing now, the answer would have been very different!</p><p>Read on below to learn about Ervins's story and how the soft skills he has gained throughout his career thus far, coupled with the technical training received at Strive, has helped him land a job as a web developer. 👇</p><p>As a salesman in the travel industry, when the pandemic hit, Ervins found himself with a lot of free time. Learning to code was something that rested in the back of Ervins's mind for a while, but he never got around to systematically taking on this challenge. With the unexpected downtime, Ervins decided that instead of sitting at home and rolling his thumbs, now was the perfect opportunity to get on with learning a new skill.</p><p>Like everyone new to programming, the first thing Ervins did was do some simple Google searches for free resources. He watched Youtube tutorials and read blogposts to learn the basics of coding, and stumbled upon <a href='https://strive.school/?utm_source=strive_blog&amp;utm_campaign=i-was-a-salesman-6-months-ago-and-now-i-am-a-professional-web-developer'>Strive School</a> by chance.</p><p>'Strive's message was straight to the point. I visited your website, read through everything, and the rest is history!' Says Ervins.</p><p>As a former salesman, Ervins is cognizant of the advantageous soft skills he brings to the table, but he also appreciated the teamwork skills gained through group projects at Strive.</p><p>'I was told that there were other more experienced candidates for my current job, but what stood out as more important for the hiring managers was my ability to communicate clearly and work in a team. Soft skills are really important even for software engineering.'</p><p>Since joining Strive, Ervins has already recommended a friend to join our new cohort 🙌 &nbsp;And when asked what tips he would give to current and future students at Strive, the wisdom is endless. 'You have to have the ability to overcome adversity,' says Ervins, 'The program was the hardest thing I've done in my life, and you need to be able to cope with feeling overwhelmed.'</p><p>He then adds, 'On top of that, you should also think about developing your social/ soft skills as in the end of the day, you will be working with other people.'</p><p>There isn't a typical day on the job for Ervins, and he hasn't stopped learning new programming frameworks to enhance his technical toolbox. Though he learned the MERN stack during his time at <a href='https://strive.school/?utm_source=strive_blog&amp;utm_campaign=i-was-a-salesman-6-months-ago-and-now-i-am-a-professional-web-developer'>Strive</a>, Ervins is now also working on a new project at work using PHP 🤓 &nbsp;For Ervins, learning doesn't stop here, because after all, this is only the beginning!</p></div>",
    "createdAt": "25 Nov 2020"
  }
]
